app/controllers/photos_controller.rb

  def index
    @photos = Photo.all
---
SELECT * FROM "photos"

  def create
    @photo = Photo.new(:image => swf_upload_data)

    if @photo.save
---
INSERT INTO "photos" ("image_file_size", "updated_at", "image_content_type", "image_updated_at", "image_file_name", "created_at") VALUES(8875, '2009-02-23 00:20:57', 'image/jpeg', 1235348457, '04.jpg', '2009-02-23 00:20:57')